Repository: HoraceHuang-ui/Utilities_Collections
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# au
source: Australia
zh_cn: 澳大利亚

# avbv.Content
source: BV / av Converter
zh_cn: BV / av 号转换

# avbv_text.Text
source: BV / av Converter
zh_cn: BV / av 号转换器

# bing_wp.Content
source: Bing Daily Wallpapers
zh_cn: 必应每日壁纸

# calc.Content
source: Free Calculator
zh_cn: 自由计算器

# calc_error.Message
source: Please check spelling / syntax / DIV0 / expression length.
zh_cn: 请检查 拼写/格式/除以0/表达式长度。

# caution_flyout_text.Text
source: Available at most 100 times per day, all users altogether.
zh_cn: 所有设备加起来每天只能解析100次噢！

# change_size.Text
source: Change Size
zh_cn: 调整大小

# cmd.Content
source: Command Prompt
zh_cn: 命令提示符

# cmdInput.PlaceholderText
source: Enter your command here...
zh_cn: 在此输入您的命令……

# cmdOutput.PlaceholderText
source: Output will be shown here
zh_cn: 命令提示符返回结果将在此显示

# cmd_title.Text
source: Command Prompt
zh_cn: 命令提示符

# cn
source: China
zh_cn: 中国

# custom_apikey_switch.Header
source: Custom apikey
zh_cn: 自定义 apikey

# custom_apikey_switch.OffContent
source: Off
zh_cn: 关

# custom_apikey_switch.OnContent
source: On
zh_cn: 开

# custom_mkt_switch.Header
source: Custom Region
zh_cn: 自定义地区

# de
source: Germany
zh_cn: 德国

# decimal_slider.Header
source: Decimal Accuracy
zh_cn: 小数精确位数

# degree_switch.Header
source: Mode
zh_cn: 模式

# degree_switch.OffContent
source: RAD
zh_cn: 弧度制

# degree_switch.OnContent
source: DEG
zh_cn: 角度制

# detcalc.Content
source: Determinant Calculator
zh_cn: 行列式计算器

# detcalc_title_text.Text
source: Determinant Calculator
zh_cn: 行列式计算器

# display_theme_text.Text
source: Theme
zh_cn: 显示模式

# edit_settingsVal_hypertext.Content
source: Quickly edit settings value
zh_cn: 快速编辑设置

# english_switch.Header
source: Language
zh_cn: 语言

# eq_form.PlaceholderText
source: Enter your expression here...
zh_cn: 在此输入算式……

# error100
source: Please send us feedback or wait for fixing.
zh_cn: 请及时反馈或等待修复。

# error110
source: API temporarily closed, keep an eye on the Notice.
zh_cn: 接口暂时关闭维护中，请注意相关公告。

# error120
source: An IP Whitelist is set, which doesn't contain the requested IP. Help: https://www.tianapi.com/article/81
zh_cn: 设置了IP白名单，来源IP不在白名单内。帮助：https://www.tianapi.com/article/81

# error130
source: API was limited because it is requested too many times in one minute.
zh_cn: API超出了分钟调用最大频率，被暂时限制。

# error140
source: Please check if the API was disabled by the user or the official.
zh_cn: 请检查接口是否被自行停用或被官方禁用。

# error150
source: API usage expired. View in API List. Help: https://www.tianapi.com/apiview/43
zh_cn: 接口可用次数不足，请在接口列表查看。帮助：https://www.tianapi.com/apiview/43

# error160
source: Please apply for the API first. Help: https://www.tianapi.com/article/104
zh_cn: 请先在对应的接口文档页面申请接口。帮助：https://www.tianapi.com/article/104

# error170
source: A Referer Whitelist is set, which doesn't contain the requested referer. Help: https://www.tianapi.com/article/121
zh_cn: 设置了Referer白名单，来源Referer不在白名单内。帮助：https://www.tianapi.com/article/121

# error230
source: Please check if apikey was wrong. Help: https://www.tianapi.com/article/28
zh_cn: 请检查apikey是否填写错误。帮助：https://www.tianapi.com/article/28

# error240
source: Please check if the key parameter was transported, e.g. if an variable was valuated.
zh_cn: 请检查是否传递了key参数，如变量请检查是否赋值。

# error250
source: Error requesting or converting data, please ensure the input is correct or retry.
zh_cn: 数据查询或转换失败，请确保输入值正确或重试。

# error260
source: Please check if the parameter is empty.
zh_cn: 请检查查询参数是否传递了空值。

# error270
source: Data is needed for the API. Help: https://www.tianapi.com/apiview/95
zh_cn: 接口需要传递数据，请参考接口文档的说明。帮助：https://www.tianapi.com/apiview/95

# error280
source: Required parameter(s) absent, please check. Help: https://www.tianapi.com/apiview/95
zh_cn: 缺少必填的参数，请根据接口文档检查。帮助：https://www.tianapi.com/apiview/95

# error290
source: Too many characters. Help: https://www.tianapi.com/apiview/95
zh_cn: 超出最大字符，请查看对应的接口文档说明。帮助：https://www.tianapi.com/apiview/95

# func_const_list.Content
source: sqr - Square root - sqr9=3 sin - Sine - sin45=0.707 cos - Cosine - co45=0.707 tan - Tangent - tan45=1 cot - Cotangent - cot45=1 abs - Absolute - abs(-10)=10 cei - Ceiling - cei4.3=5 flo - Floor - flo4.7=4 log - logarithm - log[10,100]=2 E - Euler's number - 2.7182818... p - Pi - 3.1415926...
zh_cn: sqr - 平方根 - sqr9=3 sin - 正弦 - sin45=0.707 cos - 余弦 - co45=0.707 tan - 正切 - tan45=1 cot - 余切 - cot45=1 abs - 绝对值 - abs(-10)=10 cei - 向上取整 - cei4.3=5 flo - 向下取整 - flo4.7=4 log - 对数 - log[10,100]=2 E - 自然对数的底数 - 2.7182818... p - 圆周率 - 3.1415926...

# func_const_list.PrimaryButtonText
source: OK
zh_cn: 明白

# func_const_list.Title
source: Available Functions & Constants
zh_cn: 支持的函数与常量

# info_textblock.Text
source: Info
zh_cn: 信息

# info_textbox.PlaceholderText
source: Success or failure info will be shown here
zh_cn: 返回结果成功信息及失败提示将在此显示

# ip_request.Content
source: IP Request
zh_cn: IP 地址查询

# ip_request_result.PlaceholderText
source: Full return value will be shown here in JSON, including region and carrier
zh_cn: 完整返回结果将在此以 JSON 格式显示，包括地区、运营商等

# ip_request_textblock.Text
source: IP Addr.
zh_cn: IP 地址

# ip_request_textbox.PlaceholderText
source: Enter an IP here, say, 220.181.38.251
zh_cn: 在此处输入 IP 地址，如220.181.38.251

# ip_request_title_text.Text
source: IP Request
zh_cn: IP 地址查询

# ip_res_error
source: Error occured.
zh_cn: 失败。

# ip_res_success
source: Succeeded.
zh_cn: 成功。

# ip_textblock.Text
source: IP Addr.
zh_cn: IP 地址

# ip_textbox.PlaceholderText
source: IP address(es) analyzed from the output will be shown here.
zh_cn: 从返回结果中解析到的 IP 地址将在此显示

# ip_url.Content
source: Domain Analyzer
zh_cn: 域名解析

# ip_url_title_text.Text
source: Domain Analyzer
zh_cn: 域名解析

# jp
source: Japan
zh_cn: 日本

# mkt_au.Text
source: Australia
zh_cn: 澳大利亚

# mkt_cn.Text
source: China
zh_cn: 中国

# mkt_de.Text
source: Germany
zh_cn: 德国

# mkt_jp.Text
source: Japan
zh_cn: 日本

# mkt_nz.Text
source: New Zealand
zh_cn: 新西兰

# mkt_uk.Text
source: United Kingdom
zh_cn: 英国

# mkt_us.Text
source: United States
zh_cn: 美国

# number_region.Content
source: Number Region
zh_cn: 号码归属地

# number_title_text.Text
source: Phone Number Region
zh_cn: 手机号码归属地

# num_textblock.Text
source: Number
zh_cn: 号码

# num_textbox.PlaceholderText
source: Enter a Chinese phone number here, say, 13967880048
zh_cn: 在此处输入中国手机号，如 13967880048

# nz
source: New Zealand
zh_cn: 新西兰

# panemode_ddb_text.Text
source: Left
zh_cn: 左侧

# panemode_textblock.Text
source: Navigation Pane Placement
zh_cn: 导航栏位置

# pane_left.Text
source: Left
zh_cn: 左侧

# pane_top.Text
source: Top
zh_cn: 顶部

# quick_edit_box.Text
source: Saved.
zh_cn: 已保存。

# rb_dark.Content
source: Dark
zh_cn: 暗色

# rb_default.Content
source: Default
zh_cn: 系统默认

# rb_light.Content
source: Light
zh_cn: 亮色

# refresh_wallpaper.Content
source: Refresh
zh_cn: 刷新

# reset_all_btn.Text
source: Reset All
zh_cn: 重置所有设置

# reset_confirm.Content
source: All your settings will be resetted to default.
zh_cn: 所有设置都将回归默认。

# reset_confirm.PrimaryButtonText
source: OK
zh_cn: 确定

# reset_confirm.SecondaryButtonText
source: Cancel
zh_cn: 取消

# reset_confirm.Title
source: Are you sure?
zh_cn: 确定重置吗？

# restart_for_effect_text_1.Text
source: Restart the app to take effect.
zh_cn: 重启此应用即可生效

# result.PlaceholderText
source: Full return value will be shown here in JSON
zh_cn: 完整返回结果将在此以 JSON 格式显示，包括存活时间、类型等

# res_textblock.Text
source: Output
zh_cn: 返回值

# save_image.Text
source: Save Image
zh_cn: 保存图片

# settings.Content
source: Settings
zh_cn: 设置

# settings_subt_bing.Text
source: Bing Daily Wallpapers
zh_cn: 必应每日壁纸

# settings_subt_domain.Text
source: Domain Analyzer / IP Request
zh_cn: 域名解析 / IP 地址查询

# settings_subt_freecalc.Text
source: Free Calculator
zh_cn: 自由计算器

# settings_subt_general.Text
source: General
zh_cn: 通用

# settings_title_text.Text
source: Settings
zh_cn: 设置

# show_func_btn.Content
source: Show Available Functions & Constants
zh_cn: 查看可用函数及常量列表

# text1.Text
source: Welcome to Utilities by Hyy!
zh_cn: 欢迎使用 hyy 小工具大杂烩！

# text2.Text
source: Pick one on the left!
zh_cn: 在左侧导航栏寻找你想要的工具吧！

# tianapi_error
source: Error. Please check your Firewall and network connection.
zh_cn: 失败。请检查您的防火墙设置以及连接情况。

# tianapi_loading
source: Loading...
zh_cn: 加载中…

# tianapi_phone_argError
source: Error. Please check if the phone number is valid.
zh_cn: 失败。请检查是否输入了合法的手机号码。

# tip1.ActionButtonContent
source: Get Started!
zh_cn: 开始吧！

# tip1.CloseButtonContent
source: No Thanks.
zh_cn: 不用啦！

# tip1.Subtitle
source: This will take you to a quick tour through all the features of FreeCalc by Horace. Press 'x' on any tip to quit.
zh_cn: 这个教程将会带你了解 FreeCalc的所有功能。你可以在任意提示框中点击 'x' 号来退出。

# tip1.Title
source: Welcome to FreeCalc!
zh_cn: 欢迎来到 FreeCalc！

# tip16.Subtitle
source: Now you've completed the whole tutorial. Enjoy FreeCalc by Horace! Explore Settings for more features!
zh_cn: 现在你已经完成了全部教程，尽情享受 FreeCalc 吧！设置中还有更多惊喜等着你噢！

# tip16.Title
source: Congratulations!
zh_cn: 恭喜！

# tip2.ActionButtonContent
source: Example
zh_cn: 查看示例

# tip2.Subtitle
source: FreeCalc supports basic expressions. Try entering an expression containing +-*/^() and press enter.
zh_cn: FreeCalc 支持进行基础组合运算。试试看输入一个带有 +-%*/^()的算式然后按回车。

# tip2.Title
source: Basic Calculation
zh_cn: 基础运算

# tip3.Subtitle
source: If you've selected(focused on) the expression box, just press enter. If not, clicking the tick icon on the right does the same thing.
zh_cn: 如果运算框呈现不透明纯白色，则直接按回车；若非如此，点击运算框右边的勾来提交。

# tip3.Title
source: Now submit
zh_cn: 现在提交

# tip4.Subtitle
source: Just tap on the result text box, and the result will be autofilled to your expression box.
zh_cn: 只需点击一下答案框，即可快速将答案输入到运算框内。

# tip4.Title
source: Result autofill
zh_cn: 答案自动填充

# tip5.ActionButtonContent
source: See function list
zh_cn: 查看函数列表

# tip5.CloseButtonContent
source: Example
zh_cn: 查看示例

# tip5.Subtitle
source: FreeCalc supports multiple functions, try 'em out!
zh_cn: FreeCalc 支持函数运算，来试试吧！

# tip5.Title
source: Meet functions
zh_cn: 函数运算

# tip6.Subtitle
source: Submit again to see the result.
zh_cn: 提交一下来查看结果。

# tip6.Title
source: Now submit
zh_cn: 现在提交

# tip8.ActionButtonContent
source: Example
zh_cn: 查看示例

# tip8.Subtitle
source: Two constants are available in FreeCalc so far, e and Pi. Enter 'E' for e, 'P' for Pi.
zh_cn: FreeCalc 支持两个常量，自然常数 e 和圆周率 π 。输入大写 'E' 代表 e，大写 'P' 代表 π。

# tip8.Title
source: Meet constants
zh_cn: 常量运算

# tip9.Subtitle
source: Submit again to see the result.
zh_cn: 提交一下来查看结果。

# tip9.Title
source: Now submit
zh_cn: 现在提交

# toppane
source: Top
zh_cn: 顶部

# uk
source: United Kingdom
zh_cn: 英国

# url_textblock.Text
source: URL
zh_cn: 域名

# url_textbox.PlaceholderText
source: Enter a URL here, say, baidu.com
zh_cn: 在此处输入域名，如 baidu.com

# us
source: United States
zh_cn: 美国

# utilities_home.Content
source: Home
zh_cn: 主页

# wallpaper_failed.Message
source: Please check your Firewall and network connection.
zh_cn: 请检查您的防火墙设置以及连接情况。

# wallpaper_loading.Text
source: Loading...
zh_cn: 请稍候…

# welcome_again_btn.Text
source: Show Update Logs
zh_cn: 再次显示更新内容

# wp_res_text.Text
source: Resolution
zh_cn: 分辨率

# wp_title_text.Text
source: Bing Daily Wallpapers
zh_cn: 必应每日壁纸
